package Chapter3.Exercises;

import static net.mindview.util.Print.*;

/**
 * 1. Напишите программу, в которой используются как «короткие», так и «длинные» команды печати.
 * date: 06.09.2020
 */
public class FirstExercise {

    public static void main(String[] args) {
        System.out.println("Длинная команда печати");
        print("Короткая команда печати");
    }
}