package Chapter2.Exercises;

/**
 * 2. На основании примера HelloDate.java в этой главе напишите программу "Привет, мир", которая просто выводит
 * это сообщение. Программа будет содержать только один метод (тот, который исполняется при запуске программы - main()).
 * Не забудьте объявить его статическим (static) и включите список аргументов, даже если вы не будете его
 * использовать. Скомпилируйте программу с помощью javac и запустите на исполнение из java. Если вы используете не
 * JDK, а другую среду разработки программ, выясните, как в ней компилируются и запускаются программы.
 * @see Chapter2.Examples.HelloDate
 * date: 15.02.2020
 */
public class SecondExercise {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}